app/views/posts/_post.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 10]]
---
        <% if post.comments %>
          <% post.comments.each do |comment| %>