app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Ruby"], ["post_id", 10], ["user_id", 2], ["created_at", "2016-07-14 06:00:40.916925"], ["updated_at", "2016-07-14 06:00:40.916925"]]
---
def create
  @comment = @post.comments.build(comment_params)
  @comment.user_id = current_user.id

  if @comment.save